app/controllers/authors/articles_controller.rb

		def index
			@articles = current_author.article.all # sort acc to timestamp later
---
SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 1]]

		def show
			@article = current_author.article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."author_id" = ? AND "articles"."id" = ? LIMIT ?  [["author_id", 1], ["id", 6], ["LIMIT", 1]]

		def edit
			@article = current_author.article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."author_id" = ? AND "articles"."id" = ? LIMIT ?  [["author_id", 1], ["id", 6], ["LIMIT", 1]]

		def create
			#render plain: params[:post].inspect
			@article = current_author.article.new(article_params)

			if(@article.save)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My First"], ["body", "Hello First"], ["created_at", "2017-08-17 13:30:57.665202"], ["updated_at", "2017-08-17 13:30:57.665202"], ["author_id", 1]]

		def update
			@article = current_author.article.find(params[:id])

			if(@article.update(article_params))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."author_id" = ? AND "articles"."id" = ? LIMIT ?  [["author_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?