app/controllers/blog/articles_controller.rb

		def index
			@articles = Article.all # sort acc to timestamp later
---
SELECT "articles".* FROM "articles"